@extends('layouts.main')
@section('title', 'Гіпоксичний тест Штанге & Генчі')

@section('content')
<h1>Гіпоксичний тест Штанге та Генчі</h1>
<p class="indent"><b>Гіпоксичний тест</b> - тест на затримку дихання, який використовується для виявлення гіпоксії (кисневого голодування) - 
 патологічного стану, під час якого тканини і органи недостатньо насичуються киснем або кисню достатньо, але він не
 засвоюється тканинами. Використовується проба Штанге (затримка на вдиху) і Генчі (затримка на видиху).</p>
 
{!! Form::open(['route' => 'shtange-genchi.result', 'class' =>'text-center']) !!}
<h2>Послідовність дій</h2>
<p>Сядьте в комфортне для себе положення та зробіть вдих, затримайте дихання на комфортний для вас час.
Внесіть результат у форму.</p>
<div>
    {!! Form::label('Затримка на вдиху (сек)') !!}
    {!! Form::number('shtange') !!}
</div>
<p>Посидіть кілька хвилин та нормалізуйте дихання. Тепер повільно вдихніть, видихніть і затримайте кисень на видиху.
Час комфортної затримки дихання на видиху внесіть до форми.</p>
<div>
    {!! Form::label('Затримка на видиху (сек)') !!}
    {!! Form::number('genchi') !!}
</div>
<div>{!! Form::submit('Перевірити результат', ['class' => 'btn btn-primary mt-2']) !!}</div>
{!! Form::close() !!}
@endsection
