@extends('layouts.main')
@section('title', 'Проба Руф\'є')

@section('content')
<h1>Проба Руф'є</h1>
<p class="indent"><b>Проба Руф'є</b> - це простий та універсальний метод діагностики функціонального стану серцево-судинної системи,
розробленний французьким лікарем <i>Джеймсом Руф'є (1875-1964)</i>, що часто застосовується в спортивній медицині та
при фізичній реабілітації для визначення рівня підготовки організму до фізичних навантажень.</p>

<p class="text-center h4">Послідовність дій:</p>

@if($errors->any())
    {!! implode('', $errors->all('<div class="text-danger">:message</div>')) !!}
@endif

{!! Form::open(['route' => 'ruffier-test.result']) !!}
<ol>
    <li>Потрібно лягти на спину, та полежати в спокійному стані 5 хв</li>
    <li>Виміряйте пульс на протязі 15 секунд та внесіть до форми (П1): {!! Form::number('pulse1') !!}</li>
    <li>Тепер зробіть 30 присідань за 45 секунд</li>
    <li>Приляжте, виміряйте пульс на протязі 15 секунд після виконання вправи та внесіть до форми (П2): {!! Form::number('pulse2') !!}</li>
    <li>Зачекайте 30 секунд</li>
    <li>Знову виміряйте пульс на протязі 15 секунд та внесіть до форми (П3): {!! Form::number('pulse3') !!}</li>
    <li>Натисніть кнопку розрахувати індекс Руф'є</li>
</ol>
{!! Form::submit('Розрахувати індекс Руф\'є', ['class' => 'btn btn-success']) !!}
{!! Form::close() !!}
@endsection